bfs2dData/system/sample_2d
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         | OpenFOAM
|  \\    /   O peration     |
|   \\  /    A nd           |
|    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}

type sets;

libs ("libsampling.so");

interpolationScheme cellPoint;

setFormat raw;

fields
(
    U
    p
);

sets
(
    grid
    {
        type cloud;
        axis xyz;
        points #include "./gridPoints.xyz";
    }
);